In [1]:
import pandas as pd

In [2]:
friends = [{'name':'Jone','age':20,'job':'student'},
           {'name':'Jenny','age':30,'job':None},
           {'name':'Nate','age':30,'job':'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [3]:
df.to_csv('friends.csv',index = True, header = True)

In [4]:
#인덱스와 헤더는 기본값으로 True가 들어가있다 False값을 지정해주면 나오지않는다

In [5]:
#na_rep = '-' ->빈칸대신에 - 을 넣어주어라

In [6]:
df[1:3]

    name  age      job
1  Jenny   30     None
2   Nate   30  teacher

In [7]:
df #결과값이 저장되지는않는다. 저장하고싶으면 다시 df = 로 선언을 해주어야한다.

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [8]:
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

In [9]:
df = df.loc[[0,2]]

In [10]:
df

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

In [11]:
friends = [{'name':'Jone','age':20,'job':'student'},
           {'name':'Jenny','age':30,'job':None},
           {'name':'Nate','age':30,'job':'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [12]:
## by column condition

In [13]:
df[df.age>25]

    name  age      job
1  Jenny   30     None
2   Nate   30  teacher

In [14]:
df.query('age>25')

    name  age      job
1  Jenny   30     None
2   Nate   30  teacher

In [15]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [16]:
df[(df.age>25)&(df.name== 'Nate')]

   name  age      job
2  Nate   30  teacher

In [17]:
## Filter Column

In [18]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [19]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [20]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [21]:
#by column name

In [22]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [25]:
df = df.drop(df.index[0])

In [26]:
df

       0   1          2
1  Jenny  30  developer
2   Nate  30    teacher

In [27]:
df

       0   1          2
1  Jenny  30  developer
2   Nate  30    teacher

In [47]:
friend_dict_list = [{'name':'Jone','midterm':95,'final':85},
                  {'name':'Jenny','midterm':85,'final':80},
                    {'name':'Nate','midterm':30,'final':10}]
df = pd.DataFrame(friend_dict_list, columns = ['name','midterm','final'])

In [45]:
df

    name  midterm final
0   Jone       95    85
1  Jenny       85    80
2   Nate       30    10

In [37]:
df['salary'] = 0

In [38]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [39]:
import numpy as np

In [40]:
df['salary'] = np.where(df['job'] !='student','yes','no' )

In [41]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [48]:
df['total'] = df['midterm'] + df['final']

In [50]:
df

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [51]:
df['average'] = df['total'] /2

In [52]:
df

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [53]:
grades = []
for row in df['average']:
    if row >= 90 :
        grades.append('A')
    elif row >= 80 :
        grades.append('B')
    else:
        grades.append('F')
df['grade'] = grades

In [54]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [57]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [58]:
df.grade = df.grade.apply(pass_or_fail)

In [59]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [62]:
date_list = [
    { 
    'yyyy-mm-dd': '2000-06-27'
    },{ 
    'yyyy-mm-dd': '2007-10-27'
    }
]
df =pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [63]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [66]:
def extract_year(row):
    return row.split('-')[0]

In [67]:
df['year'] =df['yyyy-mm-dd'].apply(extract_year)

In [68]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [69]:
friend_dict_list = [{'name':'Jone','midterm':95,'final':85},
                  {'name':'Jenny','midterm':85,'final':80},
                    {'name':'Nate','midterm':30,'final':10}]
df = pd.DataFrame(friend_dict_list, columns = ['name','midterm','final'])

In [71]:
df2 = pd.DataFrame([
    ['Ben',50,50]
],columns = ['name','midterm','final'])

In [72]:
df2

  name  midterm  final
0  Ben       50     50

In [75]:
df =df.append(df2, ignore_index = True)

In [76]:
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

In [3]:
import pandas as pd
student_list= [{'name':'John','major':'Computer Science','sex':'male'},
              {'name':'Nate','major':'Computer Science','sex':'male'},
               {'name':'Abraham','major':'Physics','sex':'male'},
               {'name':'Brian','major':'Psychology','sex':'male'},
               {'name':'Janny','major':'Economics','sex':'female'},
               {'name':'Yuna','major':'Economics','sex':'female'},
               {'name':'Jeniffer','major':'Computer Science','sex':'female'},
               {'name':'Edward','major':'Computer Science','sex':'male'},
               {'name':'Zara','major':'Psychology','sex':'female'},
               {'name':'Wendy','major':'Economics','sex':'female'},
               {'name':'Sera','major':'Psychology','sex':'female'}]
df = pd.DataFrame(student_list,columns = ['name','major','sex'])

In [5]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [7]:
groupby_major = df.groupby('major')

In [8]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [12]:
for name, group in groupby_major:
    print(name + ':' + str(len(group)))
    print(group)
    print()

Computer Science:4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics:3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics:1
      name    major   sex
2  Abraham  Physics  male

Psychology:3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [17]:
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [20]:
groupby_sex = df.groupby('sex')
for name, group in groupby_sex:
    print(name + ':' + str(len(group)))
    print(group)
    print()

female:6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male:5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [21]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [22]:
df.drop_duplitcates() ##중복된 값을 지워준다.

AttributeError: 'DataFrame' object has no attribute 'drop_duplitcates'

In [30]:
df.duplicated('major')

0     False
1      True
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
dtype: bool

In [32]:
df.drop_duplicates(['major'],keep = 'first')

      name             major     sex
0     John  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Janny         Economics  female

In [50]:
school_id_list = [{'name':'John','job':'teacher','age':40},
                {'name':'Nate','job':'teacher','age':35},
                {'name':'Yuna','job':'teacher','age':37},
                 {'name':'Abraham','job':'student','age':10},
                 {'name':'Brian','job':'student','age':12},
                 {'name':'Janny','job':'student','age':11},
                 {'name':'Nate','job':'teacher','age':None},
                 {'name':'John','job':'student','age':None}]

In [51]:
df = pd.DataFrame(school_id_list, columns = ['name','job','age'])

In [52]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [39]:
df.shape

(8, 3)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [41]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [42]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [43]:
df.age = df.age.fillna(0)

In [46]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [53]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [55]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace =True )

In [56]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [7]:
date_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}]
df = pd.DataFrame(date_list,columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [8]:
import pandas as pd
def extract_year(column):
    return column.split("-")[0]

In [9]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [10]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [14]:
def get_age(year, current_year):
    return current_year - int(year)

df['age'] = df['year'].apply(get_age, current_year=2019)

In [15]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   19
1  2002-09-24  2002   17
2  2005-12-20  2005   14

In [16]:
def get_introduce(age,prefix,suffix):
    return prefix+str(age)+suffix

In [19]:
df['introduce'] = df['age'].apply(get_introduce, prefix = "I am", suffix = "years old")

In [20]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-06-27  2000   19  I am19years old
1  2002-09-24  2002   17  I am17years old
2  2005-12-20  2005   14  I am14years old

In [21]:
def get_introduce_2(row):
    return "I was born in " +str(row.year) + "my age is " + str(row.age)

In [28]:
df['introduce_3'] = df.apply(get_introduce_2, axis = 1)

In [29]:
df

,yyyy-mm-dd,year,age,introduce,introduce_3
0,2000-06-27,2000,19,I was born in 2000my age is 19,I was born in 2000my age is 19
1,2002-09-24,2002,17,I was born in 2002my age is 17,I was born in 2002my age is 17
2,2005-12-20,2005,14,I was born in 2005my age is 14,I was born in 2005my age is 14

In [31]:
date_list = [{'date':'2000-06-27'},
            {'date':'2002-09-24'},
             {'date':'2005-12-20'}]
df = pd.DataFrame(date_list,columns=['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [32]:
def extract_year(date):
    return date.split('-')[0]

In [33]:
df['year'] = df['date'].map(extract_year)

In [34]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005